{"id": 1, "volume": 1, "url": "https://readnovelfull.com/only-i-level-up/chapter-1-prologue.html", "title": "Chapter 1 - Prologue", "volume_title": "Volume 1", "body": "<h1>Chapter 1 - Prologue</h1>\n<p> Chapter 1: Prologue </p>\n<p> Part 0: Prologue </p>\n<p> [Daily Quest is now available.] </p>\n<p> An articulate voice of a young female. </p>\n<p> This was definitely not a game. Of course, it wasn’t a dream, either. </p>\n<p> But, her voice definitely resounded within my head. Hell, I could even see the quest window floating in mid-air, too. </p>\n<p> ‘Could it be… Even today?” </p>\n<p> While fervently praying in my head, I cautiously opened the information window. </p>\n<p> Ttiring…. </p>\n<p> [Daily Quest: Preparations to become strong] </p>\n<p> Press-up, 100 times: Incomplete (0/100) </p>\n<p> Sit-up, 100 times: Incomplete (0/100) </p>\n<p> Squat, 100 times: Incomplete (0/100) </p>\n<p> Running, 10 km: Incomplete (0/10) </p>\n<p> ※Warning: Incompletion of Daily Quests will result in appropriate levels of punishment. </p>\n<p> As soon as I got to confirm the contents of the Daily Quest, I began cussing out reflexively. </p>\n<p> “Awww… Just how many days has it been already?!” </p>\n<p> *** </p>\n<p> Part 1: Rank E Hunter </p>\n<p> Rank E Hunter, Seong Jin-Woo. </p>\n<p> No matter where he went, this title always followed him around. </p>\n<p> Jin-Woo’s overall strength was almost the same as a regular human being. With the exception of being a bit stronger and his wounds healing slightly faster, Jin-Woo was about the same as regular people in every other aspect. </p>\n<p> It was par for the course then, that he’d always end up getting injured. He nearly died several times, too. </p>\n<p> Of course, it wasn’t as if Seong Jin-Woo liked being a Hunter. </p>\n<p> The work was dangerous, others made fun of him, and to confound the matters even further, the pay was pretty pathetic, as well. </p>\n<p> If it weren’t for the medical aid paid out by the Hunter Association to the Hunters in their “payroll”, he’d have turned in his hunter licence and quit by now, and live his life like a regular person. </p>\n<p> Unfortunately, someone like Seong Jin-Woo, in his mid-twenties and lacking in any tangible job skills, there was no other way but to remain as a Hunter if he wanted to pay for his mother’s hospital fee of millions of won every month. </p>\n<p> Should one say that he had no choice in the matter? </p>\n<p> That was why, even though he didn’t want to, he simply had to participate in the raid supervised by the Association. </p>\n<p> *** </p>\n<p> Hunters operating within the same area tended to know each other pretty well. In the event of a Gate opening up, all the Hunters in that district would be asked to come, that’s why. </p>\n<p> The Hunters who had arrived early sipped on the cups of coffee handed out by the Association’s employee and shared cordial greetings with each other. </p>\n<p> “Oh, hey. Mister Kim, Over here. Here.” </p>\n<p> “Oh? Mister Park, what are you doing here? I thought you were giving up on being a Hunter?” </p>\n<p> “Well, that… My wife is pregnant with our second child.” </p>\n<p> “Hahahaha, is that so. Yeah, for a Hunter to earn big in one go, participating in a raid is the best, isn’t it.” </p>\n<p> Mister Kim jovially burst out in laughter. Mister Park followed suit with a sheepish chuckle, before asking Kim. </p>\n<p> “By the way, why do I feel like that the Association is calling on us less and less nowadays? Did the number of Gates decrease or something?” </p>\n<p> “Eii, of course not. That’s only because the Guilds are getting all worked up over clearing the Gates; it’s got nothing to do with the Association. I hear that various Guilds are jumping in with both feet since there is big profit involved in this whole thing.” </p>\n<p> “Well, in that case, since this raid is being supervised by the Association, it should be safe, no?” </p>\n<p> Mister Park took a glance around as if he was getting nervous. </p>\n<p> If a Guild was not involved today, that meant there wasn’t enough profit to be had, and if there wasn’t enough profit to be had, then that could only mean that this particular Gate’s difficulty would be low. </p>\n<p> Of course, nothing in this world was 100% absolute. </p>\n<p> It wasn’t just Mister Park; other Hunters were nervously glancing around as well. </p>\n<p> “Hmm. I wonder….” </p>\n<p> Mister Kim finished the rest of his coffee while avoiding answering his friend, before spotting a certain someone and raised his hand in happiness. </p>\n<p> “Uh! He’s here. Hey, Mister Seong!! Mister Seong!” </p>\n<p> Other Hunters also displayed joy at discovering that young man. </p>\n<p> “Ah, hello.” </p>\n<p> It was none other than Seong Jin-Woo. </p>\n<p> Jin-Woo performed a simple nod of the head at the joyous Mister Kim and walked by. </p>\n<p> After making sure Jin-Woo was well out of earshot, Mister Kim began sniggering while confidently speaking up. </p>\n<p> “So, Jin-Woo showed up. Then it’s going to okay today, too.” </p>\n<p> Mister Park’s eyes widened up and he hurriedly asked Kim. </p>\n<p> “What was that? Is that Hunter Seong Jin-Woo really strong?” </p>\n<p> “Ahh. Right, of course, you wouldn’t know who he is. He’s a Hunter who started working shortly after you left, you see. However, every Hunter here knows who that kid is by now.” </p>\n<p> “He’s really that strong? Wait, why is he working for the Association, then? Why not for a Guild or as a freelancer?” </p>\n<p> Kim sniggered some more before narrowing his eyes. </p>\n<p> “You know what that guy’s nickname is?” </p>\n<p> “How should I know that? C’mon, man. Just tell me already.” </p>\n<p> “Humanity’s weakest weapon.” </p>\n<p> “….Weakest? Not something like, the ultimate weapon?” </p>\n<p> “Dude, that’s the nickname for the rank S Hunter Choi Jong-In. That kid is the ‘weakest weapon’. I’m pretty sure he’s the weakest Hunter in the Republic of Korea.” </p>\n<p> “Really?” </p>\n<p> Park began frowning deeply. </p>\n<p> Why would other Hunters greet this Seong Jin-Woo if he was really that weak? After all, didn’t they need someone to trust their backs if things went south? </p>\n<p> Park couldn’t really understand the reactions of other Hunters. </p>\n<p> When Park’s head tilted this way and that, Kim chuckled and poked the side of Park with his elbow. </p>\n<p> “Eii! The raids Seong Jin-Woo participates in will only have low difficulty because he’s so weak. The Association would never entrust him with a tough job, don’t you get that? They don’t want to see him get killed, right?” </p>\n<p> Only then did Park’s expression brightened up. </p>\n<p> “R-right. Yeah.” </p>\n<p> His wife was deeply worried about him since this would be his first raid in quite a while. Honestly, even he himself was worried, too. However, now that he listened to Kim’s words, he felt like a weight was lifted off his mind. </p>\n<p> Kim continued on. </p>\n<p> “That guy, there was a rumour not too long ago that said, he got injured participating in a raid of a rank E Gate and spent a week in the hospital.” </p>\n<p> “A Hunter got injured by a rank E Gate?” </p>\n<p> “That’s right. No one expected to see a Hunter getting injured during a rank E Gate raid, so they didn’t even bring along a Healer, apparently!” </p>\n<p> “That’s why he spent a week in a hospital?! Pu-hahaha!” </p>\n<p> When Park began guffawing too loudly, Kim hurriedly hushed him. </p>\n<p> “Stop it, man. Mister Seong might hear you.” </p>\n<p> “Aigoo. I didn’t think of that.” </p>\n<p> Park cautiously checked Jin-Woo’s reactions as he continued to giggle. </p>\n<p> Thankfully, the distance was far enough and the youth didn’t seem to have heard them. </p>\n<p> Of course, they were mistaken. </p>\n<p> ‘I can hear everything, you geezers.’ </p>\n<p> A bitter smile formed on Jin-Woo as he tried hard to ignore them. At times like today, he couldn’t help but blame his unusually-acute sense of hearing. </p>\n<p> It seemed that he arrived too early and the raid was yet to commence. </p>\n<p> ‘Did I arrive too early?’ </p>\n<p> Jin-Woo looked around to while away the waiting time, spotted the Association employee handing out warm coffee, and walked closer. </p>\n<p> “Can I get a cup of coffee as well?” </p>\n<p> “Oh. Seong Jin-Woo Hunter-nim… I’m really sorry, but we ran out of coffee just now.” </p>\n<p> “……” </p>\n<p> The cold Winter breeze brushed past the tip of his nose. </p>\n<p> Jin-Woo quietly wiped his nose with his index finger. </p>\n<p> What a sad day it was, for the coffee to run out as soon as it was his turn to get one. </p>\n<p> *** </p>\n<p> “Why do you persist on being a Hunter, Mister Seong Jin-Woo?” </p>\n<p> “I’m sorry.” </p>\n<p> Jin-Woo lowered his head and apologised. </p>\n<p> The young, beautiful girl using healing magic in front of Jin-Woo, Yi Ju-Hui showed how unhappy she was with a pouting expression. </p>\n<p> “I’m not trying to get you to apologise, you know? I’m only worried about you. If you continue fighting this way, sooner or later you’ll be faced with a truly dangerous situation.” </p>\n<p> Jin-Woo glanced past Yi Ju-Hui’s shoulders and took a look at other Hunters fighting over yonder. </p>\n<p> When one entered through the Gate, one would arrive at a place called ‘dungeon’. The rank of this particular dungeon should be around D. </p>\n<p> A dozen-plus Hunters were taking care of the monsters inside this dungeon without so much as breaking a sweat. </p>\n<p> Unfortunately, for a rank E, such a feat was nearly impossible. </p>\n<p> Normally, the job of healing the injured Hunters from the back fell on the Healers. Since he always got injured during raids, Jin-Woo was rather well-known among the Healers. </p>\n<p> Yi Ju-Hui cautiously asked him. </p>\n<p> “Perchance, is there a reason why you can’t give up being a Hunter?” </p>\n<p> Jin-Woo resolutely shook his head. </p>\n<p> He didn’t want to reveal anything personal to other people. </p>\n<p> “I’m only doing this as a hobby. If I don’t do this, I’ll probably die of boredom, actually.” </p>\n<p> Yi Ju-Hui pouted even more. </p>\n<p> “If you continue on with this hobby of yours, soon you’d be raiding a dungeon in the netherworld, you know?” </p>\n<p> Jin-Woo was taken off-guard from her remark and ended up chuckling out loudly. </p>\n<p> Thanks to that, Yi Ju-Hui’s nagging intensified. </p>\n<p> “Ah, ahh!! Don’t laugh! Don’t! Your injuries might get worse!!” </p>\n<p> Jin-Woo giggled before asking her. </p>\n<p> “Where did you even learn to say stuff like that?” </p>\n<p> “What do you mean, where? It’s from Mister Kim waaay over there.” </p>\n<p> “Aigoo, that ahjussi really went and did it, didn’t he….” </p>\n<p> As they chatted and laughed, his treatment was almost over. </p>\n<p> It was already too late by then, though. It seemed that the raid was pretty much over now. </p>\n<p> Jin-Woo’s expression hardened. </p>\n<p> ‘I only killed a single monster today.’ </p>\n<p> A rank E creature, no less. Seong Jin-Woo began fidgeting with the rank E magic crystal in his hand. </p>\n<p> The lowest grade magic crystal from a rank E monster fetched less than hundred thousand won. For something he bet his life to earn, it was a pathetically small amount. (TL: Just over $88.) </p>\n<p> ‘A magic crystal from a rank C monster can sell for over ten million won, though….’ (TL: $8830+) </p>\n<p> Too bad, a rank E Hunter such as himself couldn’t even attempt to kill a monster with a rank as high as C. </p>\n<p> Out of the blue, someone shouted out. </p>\n<p> “Uh? Hey, there’s another entrance over here.” </p>\n<p> The nearby Hunters rushed over there. </p>\n<p> “Huh, it’s true.” </p>\n<p> “There really is another path?” </p>\n<p> Just as that Hunter said, there was an entrance hidden within the dungeon itself. </p>\n<p> “A dual dungeon, is it… So, such a thing actually exists for real….” </p>\n<p> Mister Song, possessing over ten years’ experience as a Hunter, looked into the hidden entrance and displayed how surprised he was. </p>\n<p> The interior of the hidden, cave-like passage was dark and nothing could be seen. Mister Song activated his speciality, flame magic, and tossed it further forward into the passage. </p>\n<p> The flame flew forward and illuminated the interior. The passageway seemed to go on forever. Soon enough, the flame lost its forward momentum, fell to the ground and smouldered for a bit before flickering out of existence. </p>\n<p> The passage was shrouded in darkness once more. </p>\n<p> “Hmm….. Everyone, gather around. Let’s have a meeting.” </p>\n<p> The unspoken leader of this raid, Mister Song, called for other Hunters to gather around. Jin-Woo’s treatment was over by then, so he and Yi Ju-Hui also joined in. </p>\n<p> Song spoke up while sweeping his gaze over the gathered Hunters. </p>\n<p> “As you know very well, a Gate will not close unless the dungeon’s boss is killed. Since the Gate itself is still intact even though we took care of all the monsters here, that can only mean that the boss is beyond that passageway.” </p>\n<p> Song pointed towards the hidden entrance. </p>\n<p> Hunters exchanged meaningful glances and nodded their heads. No one could disagree with that notion. </p>\n<p> Song continued on. </p>\n<p> “Now normally, we’re supposed to relay this information back to the Association and wait for their decision first, but… But, if we do that, we might end up handing over the task of killing the boss to other Hunters, and our takings for today’s raid would decrease by a lot.” </p>\n<p> The expressions of the Hunters crumpled. </p>\n<p> Park’s face hardened more than anyone else since he needed a lot of cash for his wife’s pregnancy. </p>\n<p> ‘Postnatal care eats up so much cash nowadays, you know…’ </p>\n<p> At this rate, there’d be no meaning behind him risking his life to participate in this raid. </p>\n<p> “That’s why I’d prefer if we took care of the boss before leaving this dungeon… So, what do you all think?” </p>\n<p> Hunters fell into a deep contemplation. </p>\n<p> “….” </p>\n<p> “….” </p>\n<p> The truth was, no one here could figure out the current situation and so, their safety could not be guaranteed. However, the difficulty of this particular dungeon proved to be very low. </p>\n<p> So, the hidden dungeon within it couldn’t have been that difficult, either. </p>\n<p> “Hmm, hmm.” </p>\n<p> Song coughed to draw everyone’s attention to himself. </p>\n<p> “Since we have seventeen people here, let’s put this to a vote, shall we? Once the decision has been made, no one complains. So? How about it?” </p>\n<p> Others nodded their heads after hearing Song’s suggestion. No one was disagreeing with him. </p>\n<p> “I vote for going ahead.” </p>\n<p> Song raised his hand. </p>\n<p> And then, other Hunters began raising their hands one by one. </p>\n<p> “Me too.” </p>\n<p> “Count me in as well.” </p>\n<p> Park was the first to raise his hand, followed shortly after by Kim and a few other Hunters. </p>\n<p> Of course, those disagreeing were plentiful, too. </p>\n<p> “Let’s go back.” </p>\n<p> “I feel that it’d be better to wait for the Association’s decision.” </p>\n<p> The two opposing camps were neck and neck and eventually, the final votes came down to Jin-Woo and Yi Ju-Hui. </p>\n<p> “I’m sorry….” </p>\n<p> Yi Ju-Hui bowed to Song and added her vote to ‘retreat’ camp. </p>\n<p> And so, the vote count for ‘go ahead’ and ‘retreat’ was at 8:8. </p>\n<p> A deadlock. </p>\n<p> Song asked the hesitant Seong Jin-Woo next. </p>\n<p> “And you, Mister Seong?” </p>\n<p> < Chapter 1 > Fin. </p>"}