{"id": 2, "volume": 1, "url": "https://readnovelfull.com/only-i-level-up/chapter-2.html", "title": "Chapter 2", "volume_title": "Volume 1", "body": "<p> Chapter 2 </p>\n<p> Everything now depended on Seong Jin-Woo’s decision. </p>\n<p> Jin-Woo’s fingers grasped tight the rank E magic crystal in his hand as he took a glance next to him. </p>\n<p> Yi Ju-Hui was shaking her head at him. It looked like she was deeply worried. </p>\n<p> Actually, Jin-Woo was worried inwardly as well. Now normally, he would never try to take on any unnecessary risk. Not only did he lack the abilities to do so, but he was also not brave enough, too. </p>\n<p> However, Jin-Woo had a younger sister who was about to become a university student in the coming months. </p>\n<p> ‘I’ve no money saved up….’ </p>\n<p> Currently, Jin-Woo was twenty-four years old. </p>\n<p> He was at an age where he should be concentrating on his academic pursuits, but he gave up on that dream because, well, he had no money. He sure as hell didn’t want his little sister to go through the same sacrifice, the same pain as he did. </p>\n<p> Right now, every cent was precious to him. </p>\n<p> It wasn’t only Mister Park who needed a big score today. </p>\n<p> Jin-Woo raised his hand up high. </p>\n<p> “I vote for going ahead.” </p>\n<p> It was then, he heard a soft sigh of resignation coming from his side. </p>\n<p> Part 2: The Dual Dungeon </p>\n<p> The passageway went on and on forever. </p>\n<p> In front, Mister Song and other strong Hunters had taken the lead. Song had summoned a small flame on top of his palm to illuminate the way forward. </p>\n<p> Mister Kim asked him as he walked alongside Song. </p>\n<p> “We’ve walked really far, haven’t we? Shouldn’t we consider the time we need to escape from here as well?” </p>\n<p> “How long have we been walking?” </p>\n<p> Kim looked at his wristwatch. </p>\n<p> “Around…. forty minutes.” </p>\n<p> “A Gate shuts down completely one hour after the boss is killed, so we have a window of twenty minutes left or so.” </p>\n<p> “If we can’t see the boss in the next twenty minutes, I suggest that we should just give up.” </p>\n<p> “I guess so.” </p>\n<p> Song nodded his head for a while, before pointing to his back with his thumb. </p>\n<p> “Mister Kim? It’s dark out in front, so why don’t you position yourself behind me?” </p>\n<p> Kim stared at Song’s flames for a second or two, before he wordlessly pulled out his smartphone and switched on the screen. </p>\n<p> And then, the passageway got illuminated rather brightly. </p>\n<p> “…” </p>\n<p> Song alternated his gaze between his flame and the smartphone, before he too wordlessly began searching for his own phone. </p>\n<p> *** </p>\n<p> The very back of the group was the spot reserved for Seong Jin-Woo, who was injured pretty badly not too long ago, and Yi Ju-Hui, who didn’t possess any combat skills whatsoever. </p>\n<p> Jin-Woo scratched the back of his neck. </p>\n<p> “Pardon me, I… I’m really sorry.” </p>\n<p> “About what?” </p>\n<p> “About, you know, dragging you here against your wishes.” </p>\n<p> “I’m fine with it, so you don’t need to mind me.” </p>\n<p> Jin-Woo cautiously studied Ju-Hui’s expression. She definitely did not look fine at all. </p>\n<p> Jin-Woo tilted his head this way and that while trying to read her mood better, before he asked her again, even more cautious than before. </p>\n<p> “Are you… really fine?” </p>\n<p> That prompted Ju-Hui to shift her gaze towards him. </p>\n<p> “Of course I’m not. Are you of a sane mind?! If you were stabbed a couple of inches higher, you’d have a hole in your heart by now! And, what about those injuries on your arms and legs? I worked so hard to heal you somehow, yet you wish to throw yourself into yet another dungeon?? Plus, you don’t even know where we’re going, too!” </p>\n<p> She spoke so quickly that Jin-Woo felt like his mind was getting numb from hearing her. </p>\n<p> However, she was right about everything. </p>\n<p> If it weren’t for the presence of the outstanding Healer ranked B, Yi Ju-Hui, Jin-Woo wouldn’t have been able to carry on living unaffected, never mind working as a Hunter. It was a small wonder why such high ranked and hard-to-find Healers were valued so greatly within the halls of the Association. </p>\n<p> ‘Wait, now that I think about it, I owe Miss Ju-Hui a lot, don’t I?’ </p>\n<p> Ju-Hui was a Healer-type Hunter, a rarest of the rare breeds. </p>\n<p> Not only that, she was a genius ranked at ‘B’ as well. </p>\n<p> The Association always asked her to heal the injured Hunters whenever a Gate opened up. And whenever Jin-Woo participated in a raid, he’d almost always end up sitting down next to her. </p>\n<p> “Are you in pain? Please hold on for a little while longer.” </p>\n<p> “Haven’t I seen you before….? By any chance, are you the person from the last time?” </p>\n<p> “You’re injured again?” </p>\n<p> “It’s like, we’re running into each other quite often nowadays, isn’t it?” </p>\n<p> “You said that your name is Mister Jin-Woo? Well, that… Is it going to be alright?” </p>\n<p> “Maybe, uhm, this life of a Hunter doesn’t really suit you….” </p>\n<p> “….You’re here again.” </p>\n<p> “Show me your arm. No, not that one. Use bandages on that arm. I meant the other one with the bone fracture.” </p>\n<p> At the moment, it was way past the point of Jin-Woo feeling grateful for everything she had done, and firmly into the territory of him being apologetic for inconveniencing her. </p>\n<p> “…” </p>\n<p> When Jin-Woo looked dispirited, Ju-Hui also felt a bit bad about scolding him just now and her attitude softened up considerably. </p>\n<p> “You’re really sorry?” </p>\n<p> “Yes, I am.” </p>\n<p> Ju-Hui fell into a deep contemplation for a bit, before she began gazing at him with the corner of her eyes and her lips slowly arched up. </p>\n<p> “If you’re really sorry, then… how about you buy me dinner sometime?” </p>\n<p> Now that was a totally unexpected offer. </p>\n<p> Jin-Woo looked at her with an expression of surprise and found a teasing smile etched on her face like a teenage girl. </p>\n<p> ‘A teen girl, huh…..’ </p>\n<p> The truth was, Ju-Hui was still a young girl who had barely entered her twenties. </p>\n<p> Didn’t she say that she’d be twenty-one next year? </p>\n<p> If her long hair was replaced with something shorter, and her current attire was swapped out for a school uniform, she’d completely look like high school senior. </p>\n<p> His wandering mind pictured the image of Ju-Hui in a school uniform and his face reddened up somewhat. </p>\n<p> When Jin-Woo hesitated with his answer, Ju-Hui’s cheeks began puffing up like a balloon. </p>\n<p> “What the… You don’t want to buy me dinner?” </p>\n<p> It happened, right then. </p>\n<p> Suddenly, it became quite hectic out in front. </p>\n<p> “We found it!!” </p>\n<p> “It’s the boss chamber!” </p>\n<p> Jin-Woo and Ju-Hui’s gazes automatically shifted to the front. </p>\n<p> And they saw a huge stone door blocking the passage. </p>\n<p> Hunters immediately surrounded this door. </p>\n<p> “What is this? Why is there a door at the end of the cavern?” </p>\n<p> “Have we ever encountered a boss chamber with a door before?” </p>\n<p> “This is definitely the first time, I’m sure of it.” </p>\n<p> “This… Doesn’t this feel strangely dangerous?” </p>\n<p> Hunters began to express their doubts and fears one at the time. </p>\n<p> Since their own lives were on the line here, they had to be cautious and meticulous. </p>\n<p> However, if one were to become too cautious, one would end up failing to grasp the heaven-sent opportunity in the first place. Mister Song figured this was one such case. </p>\n<p> “Are you all planning to return empty-handed after coming this far?” </p>\n<p> Song placed his hands on the door. </p>\n<p> “If that’s what you want, knock yourselves out. I’m pushing ahead, even if it means I’ll be going alone.” </p>\n<p> Song was a rank C Hunter with ten years of experience. </p>\n<p> If it weren’t for his age, which was over sixty, he’d be making a killing in a big Guild by now thanks to his excellent skills. </p>\n<p> And when a Hunter like that voiced his opinion with such confidence, others began to feel less anxious than before. </p>\n<p> “Wait a minute.” </p>\n<p> A couple of Hunters began recalling rumours of dual dungeons. </p>\n<p> “I heard that there are incredible treasures hidden within dual dungeons.” </p>\n<p> “Yeah, I heard that a certain small to medium Guild found a dual dungeon and grew into a large Guild almost overnight.” </p>\n<p> “Monsters inside a dungeon always possess roughly the similar ranks no matter where they are located, so the hunt itself should not be too difficult…” </p>\n<p> What if there were incredible treasures hidden with the dual dungeon just as the rumours said, and the monsters beyond this door were about the same difficulty as the rank D, E creatures they fought until now? </p>\n<p> ‘I can’t let that old man monopolise all the treasure.’ </p>\n<p> ‘No freaking way.’ </p>\n<p> ‘Postnatal care, the school fee for the first born kid, and let’s not forget, this month’s rent is almost due, too….’ </p>\n<p> The opinions of the Hunters were now on the same page. </p>\n<p> Jin-Woo, too, steeled himself. </p>\n<p> ‘I can’t return home with just a single rank E magic crystal. At a bare minimum, I gotta kill a rank D, no, one more rank E monster!!’ </p>\n<p> It didn’t even have to be a monster, too. </p>\n<p> ‘If it’s treasure instead….’ </p>\n<p> Treasures or rare loot found in a dungeon would normally be divided equally among all the participants in a raid. It was quite a different way of sharing the rewards where one could only take possession of magic crystals one procured by themselves. </p>\n<p> ‘If we score big today, then things might improve at home for a while.’ </p>\n<p> Jin-Woo nervously swallowed down his saliva. </p>\n<p> Ju-Hui saw his determined expression and asked him. </p>\n<p> “Is that how the expression of someone who’s a Hunter as a hobby looks like?” </p>\n<p> Jin-Woo shrugged his shoulders. </p>\n<p> “Who’d bet their lives in their main line of profession nowadays? Unless it’s a hobby, obviously.” </p>\n<p> “…..Eh?” </p>\n<p> Just as a dumbfounded expression formed on Ju-Hui’s face, Song pushed the dungeon’s door and it creaked open. </p>\n<p> There must’ve been some sort of mechanism installed on the heavy-looking door, since the physical strength of a sixty-year-old man was enough to easily open it. </p>\n<p> Slam! </p>\n<p> Now that the door was wide open, the huge open interior revealed itself. Hunters hurriedly rushed in. </p>\n<p> “Let’s go in as well.” </p>\n<p> Jin-Woo feared that he’d fall behind, so he grasped Ju-Hui’s hand and took the lead. </p>\n<p> “Ah…..” </p>\n<p> Ju-Hui’s face reddened slightly as she followed after him. </p>\n<p> *** </p>\n<p> As soon as Hunters sat foot inside, flames erupted on the numerous torches packed tightly on the walls all at the same time. Thanks to that, the interior brightened up considerably. </p>\n<p> “What’s the heck? The lights came on by themselves?” </p>\n<p> “First time seeing a dungeon like this one.” </p>\n<p> “Something’s…. different about this place.” </p>\n<p> Hunters cautiously studied their surroundings. The overall atmosphere of the place was similar to that of an ancient temple. </p>\n<p> Not only that, an old and somewhat decrepit temple, something that might be buried and hidden beneath the ground; moss and weed could be seen sporadically on the floor, walls and the ceiling. </p>\n<p> Several Hunters shrunk back and shuddered slightly. </p>\n<p> “it’s a bit creepy in here, isn’t it?” </p>\n<p> “Doesn’t it feel like we’re being watched by someone?” </p>\n<p> Leaving behind the scared Hunters, the three, four strongest of the group went in deeper. </p>\n<p> “Tsk! Don’t say something that might jinx us, will ya?” </p>\n<p> “Let’s end this quickly and go home.” </p>\n<p> The interior was nonsensically huge. The chamber was shaped like a giant dome. It was as large as several Olympic stadiums, the one found in Seoul, were put together – no, maybe it was even bigger than that. </p>\n<p> However, one couldn’t help but feel that it was still inadequate. </p>\n<p> The reason for that was rather obvious. </p>\n<p> “That…. that thing over there….” </p>\n<p> “N-no freaking way that thing’s the boss, right?” </p>\n<p> In the deepest part of the dome, something so logic-defyingly humongous sat on a throne just as big as itself. It was none other than a huge stone statue of a god! </p>\n<p> “Oh, my god….” </p>\n<p> “Wow.” </p>\n<p> Shocked gasps leaked out from the Hunters. </p>\n<p> The first image popping up in Jin-Woo’s head was of the Statue of Liberty in New York. If that statue sat down on a chair, wouldn’t it be as big as that statue of the unknown god? </p>\n<p> Well, Liberty was a woman, while the one sitting on the throne was a dude, though. </p>\n<p> ‘No, hang on. Maybe it’s even bigger than that…’ </p>\n<p> Hunters began nervously swallowing their saliva near the foot of the god statue. The taut and heavy apprehension and anxiety were clear to see on their faces as they worried about this statue being the dungeon’s boss. </p>\n<p> ‘…….’ </p>\n<p> However, the statue did not budge an inch. </p>\n<p> What a fortunate thing that was. </p>\n<p> “Whew….” </p>\n<p> Even Song spat out a sigh of relief. </p>\n<p> “Okay, everyone. Spread out.” </p>\n<p> Now that they found some leeway, Hunters split among themselves and began searching around the vicinity. </p>\n<p> “I don’t think there’s a single monster in here.” </p>\n<p> “You think so, too?” </p>\n<p> “Never mind a monster, I can’t even see a single bug, too.” </p>\n<p> The chamber of the stone god statue might have been massive, yet its actual inner structure was on the simpler side. On the walls, countless torches could be found there. And in front of these walls, more stone statues, slightly taller than a human being, stood tall and unmoving. There were lots of them here as well, found at a certain distance from one another. </p>\n<p> “They are all rather beautiful, aren’t they?” </p>\n<p> “It’s like, they are works of art, no?” </p>\n<p> Objects held by each of the stone statues were varied and different. </p>\n<p> Some held weapons, there was one with a book, some carried musical instruments, and even torches. </p>\n<p> “It’s as if….” </p>\n<p> “They are like statues of a holy temple or something.” </p>\n<p> Song finished what Kim wanted to say. </p>\n<p> “Mm?” </p>\n<p> Then, Song found something beneath his feet. </p>\n<p> “This… Isn’t this a magic formation?” </p>\n<p> He found a magic formation that he had never seen before located in the middle of this temple. </p>\n<p> It was then. </p>\n<p> “Excuse me, Mister Song? Ahjussi, something’s written here. Can you come over here and take a look?” </p>\n<p> One of the Hunters discovered a statue that was different from others and called out to Song. </p>\n<p> Song stopped studying the magic formation and got up from the floor. Other Hunters all gathered around the statue Song was headed off to. </p>\n<p> Only this statue featured a pair of wings and carried a stone slate. What the Hunters focused on was the letters carved into this slate. Song took a sweeping look at the slate and muttered to no one in particular. </p>\n<p> “It’s Rune alphabet.” </p>\n<p> The Rune ‘alphabet’. </p>\n<p> Words that could not be found anywhere on Earth, and found only within dungeons; only the Hunters who had ‘awakened’ the magic-related professions could decipher them. </p>\n<p> “The laws of the Karutenon temple.” </p>\n<p> Song read the very first verse. </p>\n<p> With a deeply nervous face, Jin-Woo listened to the contents of the slate, as read out by Mister Song. </p>\n<p> However, someone suddenly tugged at his arm. </p>\n<p> When he looked back, he spotted Ju-Hui and her deathly-pale complexion. </p>\n<p> < Chapter 2 > Fin. </p>"}